RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CCM_OBS.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CCM_OBS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CCM_OBS_Peripheral_Access_Layer CCM_OBS Peripheral Access Layer
 * @{
 */

/** CCM_OBS - Size of Registers Arrays */
#define CCM_OBS_OBSERVE_COUNT                     6u

/** CCM_OBS - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x80 */
    __IO uint32_t CONTROL;                           /**< Observe control, array offset: 0x0, array step: 0x80 */
    __IO uint32_t CONTROL_SET;                       /**< Observe control, array offset: 0x4, array step: 0x80 */
    __IO uint32_t CONTROL_CLR;                       /**< Observe control, array offset: 0x8, array step: 0x80 */
    __IO uint32_t CONTROL_TOG;                       /**< Observe control, array offset: 0xC, array step: 0x80 */
         uint8_t RESERVED_0[16];
    __I  uint32_t STATUS0;                           /**< Observe status, array offset: 0x20, array step: 0x80 */
         uint8_t RESERVED_1[12];
    __IO uint32_t AUTHEN;                            /**< Observe access control, array offset: 0x30, array step: 0x80 */
    __IO uint32_t AUTHEN_SET;                        /**< Observe access control, array offset: 0x34, array step: 0x80 */
    __IO uint32_t AUTHEN_CLR;                        /**< Observe access control, array offset: 0x38, array step: 0x80 */
    __IO uint32_t AUTHEN_TOG;                        /**< Observe access control, array offset: 0x3C, array step: 0x80 */
    __I  uint32_t FREQUENCY_CURRENT;                 /**< Current frequency detected, array offset: 0x40, array step: 0x80 */
    __I  uint32_t FREQUENCY_MIN;                     /**< Minimum frequency detected, array offset: 0x44, array step: 0x80 */
    __I  uint32_t FREQUENCY_MAX;                     /**< Maximum frequency detected, array offset: 0x48, array step: 0x80 */
         uint8_t RESERVED_2[52];
  } OBSERVE[CCM_OBS_OBSERVE_COUNT];
} CCM_OBS_Type;

/* ----------------------------------------------------------------------------
   -- CCM_OBS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CCM_OBS_Register_Masks CCM_OBS Register Masks
 * @{
 */

/*! @name OBSERVE_CONTROL - Observe control */
/*! @{ */

#define CCM_OBS_OBSERVE_CONTROL_SELECT_MASK      (0x1FFU)
#define CCM_OBS_OBSERVE_CONTROL_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBS_OBSERVE_CONTROL_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SELECT_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SELECT_MASK)

#define CCM_OBS_OBSERVE_CONTROL_RAW_MASK         (0x1000U)
#define CCM_OBS_OBSERVE_CONTROL_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal
 *  0b0..Select divided signal.
 *  0b1..Select raw signal.
 */
#define CCM_OBS_OBSERVE_CONTROL_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_RAW_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_RAW_MASK)

#define CCM_OBS_OBSERVE_CONTROL_INV_MASK         (0x2000U)
#define CCM_OBS_OBSERVE_CONTROL_INV_SHIFT        (13U)
/*! INV - Invert
 *  0b0..Clock phase remain same.
 *  0b1..Invert clock phase before measurement or send to IO.
 */
#define CCM_OBS_OBSERVE_CONTROL_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_INV_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_INV_MASK)

#define CCM_OBS_OBSERVE_CONTROL_RESET_MASK       (0x8000U)
#define CCM_OBS_OBSERVE_CONTROL_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider
 *  0b0..No reset
 *  0b1..Reset observe divider
 */
#define CCM_OBS_OBSERVE_CONTROL_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_RESET_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_RESET_MASK)

#define CCM_OBS_OBSERVE_CONTROL_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBS_OBSERVE_CONTROL_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBS_OBSERVE_CONTROL_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_DIVIDE_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_DIVIDE_MASK)

#define CCM_OBS_OBSERVE_CONTROL_OFF_MASK         (0x1000000U)
#define CCM_OBS_OBSERVE_CONTROL_OFF_SHIFT        (24U)
/*! OFF - Turn off
 *  0b0..observe slice is on
 *  0b1..observe slice is off
 */
#define CCM_OBS_OBSERVE_CONTROL_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_OFF_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_OFF_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_CONTROL */
#define CCM_OBS_OBSERVE_CONTROL_COUNT            (6U)

/*! @name OBSERVE_CONTROL_SET - Observe control */
/*! @{ */

#define CCM_OBS_OBSERVE_CONTROL_SET_SELECT_MASK  (0x1FFU)
#define CCM_OBS_OBSERVE_CONTROL_SET_SELECT_SHIFT (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBS_OBSERVE_CONTROL_SET_SELECT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_SELECT_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_SELECT_MASK)

#define CCM_OBS_OBSERVE_CONTROL_SET_RAW_MASK     (0x1000U)
#define CCM_OBS_OBSERVE_CONTROL_SET_RAW_SHIFT    (12U)
/*! RAW - Observe raw signal */
#define CCM_OBS_OBSERVE_CONTROL_SET_RAW(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_RAW_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_RAW_MASK)

#define CCM_OBS_OBSERVE_CONTROL_SET_INV_MASK     (0x2000U)
#define CCM_OBS_OBSERVE_CONTROL_SET_INV_SHIFT    (13U)
/*! INV - Invert */
#define CCM_OBS_OBSERVE_CONTROL_SET_INV(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_INV_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_INV_MASK)

