RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CCM_OBS.h
#define CCM_OBS_OBSERVE_CONTROL_SET_RESET_MASK   (0x8000U)
#define CCM_OBS_OBSERVE_CONTROL_SET_RESET_SHIFT  (15U)
/*! RESET - Reset observe divider */
#define CCM_OBS_OBSERVE_CONTROL_SET_RESET(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_RESET_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_RESET_MASK)

#define CCM_OBS_OBSERVE_CONTROL_SET_DIVIDE_MASK  (0xFF0000U)
#define CCM_OBS_OBSERVE_CONTROL_SET_DIVIDE_SHIFT (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBS_OBSERVE_CONTROL_SET_DIVIDE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_DIVIDE_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_DIVIDE_MASK)

#define CCM_OBS_OBSERVE_CONTROL_SET_OFF_MASK     (0x1000000U)
#define CCM_OBS_OBSERVE_CONTROL_SET_OFF_SHIFT    (24U)
/*! OFF - Turn off */
#define CCM_OBS_OBSERVE_CONTROL_SET_OFF(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_SET_OFF_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_SET_OFF_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_CONTROL_SET */
#define CCM_OBS_OBSERVE_CONTROL_SET_COUNT        (6U)

/*! @name OBSERVE_CONTROL_CLR - Observe control */
/*! @{ */

#define CCM_OBS_OBSERVE_CONTROL_CLR_SELECT_MASK  (0x1FFU)
#define CCM_OBS_OBSERVE_CONTROL_CLR_SELECT_SHIFT (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBS_OBSERVE_CONTROL_CLR_SELECT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_SELECT_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_SELECT_MASK)

#define CCM_OBS_OBSERVE_CONTROL_CLR_RAW_MASK     (0x1000U)
#define CCM_OBS_OBSERVE_CONTROL_CLR_RAW_SHIFT    (12U)
/*! RAW - Observe raw signal */
#define CCM_OBS_OBSERVE_CONTROL_CLR_RAW(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_RAW_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_RAW_MASK)

#define CCM_OBS_OBSERVE_CONTROL_CLR_INV_MASK     (0x2000U)
#define CCM_OBS_OBSERVE_CONTROL_CLR_INV_SHIFT    (13U)
/*! INV - Invert */
#define CCM_OBS_OBSERVE_CONTROL_CLR_INV(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_INV_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_INV_MASK)

#define CCM_OBS_OBSERVE_CONTROL_CLR_RESET_MASK   (0x8000U)
#define CCM_OBS_OBSERVE_CONTROL_CLR_RESET_SHIFT  (15U)
/*! RESET - Reset observe divider */
#define CCM_OBS_OBSERVE_CONTROL_CLR_RESET(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_RESET_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_RESET_MASK)

#define CCM_OBS_OBSERVE_CONTROL_CLR_DIVIDE_MASK  (0xFF0000U)
#define CCM_OBS_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBS_OBSERVE_CONTROL_CLR_DIVIDE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_DIVIDE_MASK)

#define CCM_OBS_OBSERVE_CONTROL_CLR_OFF_MASK     (0x1000000U)
#define CCM_OBS_OBSERVE_CONTROL_CLR_OFF_SHIFT    (24U)
/*! OFF - Turn off */
#define CCM_OBS_OBSERVE_CONTROL_CLR_OFF(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_CLR_OFF_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_CLR_OFF_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_CONTROL_CLR */
#define CCM_OBS_OBSERVE_CONTROL_CLR_COUNT        (6U)

/*! @name OBSERVE_CONTROL_TOG - Observe control */
/*! @{ */

#define CCM_OBS_OBSERVE_CONTROL_TOG_SELECT_MASK  (0x1FFU)
#define CCM_OBS_OBSERVE_CONTROL_TOG_SELECT_SHIFT (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBS_OBSERVE_CONTROL_TOG_SELECT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_SELECT_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_SELECT_MASK)

#define CCM_OBS_OBSERVE_CONTROL_TOG_RAW_MASK     (0x1000U)
#define CCM_OBS_OBSERVE_CONTROL_TOG_RAW_SHIFT    (12U)
/*! RAW - Observe raw signal */
#define CCM_OBS_OBSERVE_CONTROL_TOG_RAW(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_RAW_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_RAW_MASK)

#define CCM_OBS_OBSERVE_CONTROL_TOG_INV_MASK     (0x2000U)
#define CCM_OBS_OBSERVE_CONTROL_TOG_INV_SHIFT    (13U)
/*! INV - Invert */
#define CCM_OBS_OBSERVE_CONTROL_TOG_INV(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_INV_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_INV_MASK)

#define CCM_OBS_OBSERVE_CONTROL_TOG_RESET_MASK   (0x8000U)
#define CCM_OBS_OBSERVE_CONTROL_TOG_RESET_SHIFT  (15U)
/*! RESET - Reset observe divider */
#define CCM_OBS_OBSERVE_CONTROL_TOG_RESET(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_RESET_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_RESET_MASK)

#define CCM_OBS_OBSERVE_CONTROL_TOG_DIVIDE_MASK  (0xFF0000U)
#define CCM_OBS_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBS_OBSERVE_CONTROL_TOG_DIVIDE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_DIVIDE_MASK)

#define CCM_OBS_OBSERVE_CONTROL_TOG_OFF_MASK     (0x1000000U)
#define CCM_OBS_OBSERVE_CONTROL_TOG_OFF_SHIFT    (24U)
/*! OFF - Turn off */
#define CCM_OBS_OBSERVE_CONTROL_TOG_OFF(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_CONTROL_TOG_OFF_SHIFT)) & CCM_OBS_OBSERVE_CONTROL_TOG_OFF_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_CONTROL_TOG */
#define CCM_OBS_OBSERVE_CONTROL_TOG_COUNT        (6U)

/*! @name OBSERVE_STATUS0 - Observe status */
/*! @{ */

#define CCM_OBS_OBSERVE_STATUS0_SELECT_MASK      (0x1FFU)
#define CCM_OBS_OBSERVE_STATUS0_SELECT_SHIFT     (0U)
/*! SELECT - Select value */
#define CCM_OBS_OBSERVE_STATUS0_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_SELECT_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_SELECT_MASK)

#define CCM_OBS_OBSERVE_STATUS0_RAW_MASK         (0x1000U)
#define CCM_OBS_OBSERVE_STATUS0_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal
 *  0b0..Divided signal is selected
 *  0b1..Raw signal is selected
 */
#define CCM_OBS_OBSERVE_STATUS0_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_RAW_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_RAW_MASK)

#define CCM_OBS_OBSERVE_STATUS0_INV_MASK         (0x2000U)
#define CCM_OBS_OBSERVE_STATUS0_INV_SHIFT        (13U)
/*! INV - Polarity of the observe target
 *  0b0..Polarity is not inverted
 *  0b1..Polarity of the observe target is inverted
 */
#define CCM_OBS_OBSERVE_STATUS0_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_INV_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_INV_MASK)

#define CCM_OBS_OBSERVE_STATUS0_RESET_MASK       (0x8000U)
#define CCM_OBS_OBSERVE_STATUS0_RESET_SHIFT      (15U)
/*! RESET - Reset state
 *  0b0..Observe divider is not in reset state
 *  0b1..Observe divider is in reset state
 */
#define CCM_OBS_OBSERVE_STATUS0_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_RESET_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_RESET_MASK)

